/* 有两个日期，求两个日期之间的天数，如果两个日期是连续的，则规定它们之间的天数为两天
输入格式：有多组数据，每组数据有两行，分别表示两个日期，形式为YYYYMMDD
输出格式：每组数据输出一行，即日期差值 
*/
#include<cstdio>

bool judge(int year) {  //判断是否是闰年 
	return (year%4 == 0 && year%100 != 0)|| (year%400 == 0);	
}
int main() {
	int month[13][2] = {{0,0},{31,31},{28,29},{31,31},{30,30},{31,31},{30,30},
	                  {31,31},{31,31},{30,30},{31,31},{30,30},{31,31}};  //平年和闰年每月天数
	
	int time1,y1,m1,d1;
	int time2,y2,m2,d2;
	
	while(scanf("%d %d", &time1, &time2) != EOF) {
		if(time1 > time2) {  //第一个日期晚于第二个日期，则交换 
			int temp = time1;
			time1 = time2;
			time2 = temp;
		}
		int ans = 1;  //记录结果 
		y1=time1/10000; m1=time1%10000/100; d1=time1%100;
		y2=time2/10000; m2=time2%10000/100; d2=time2%100;
		
		/*第一个日期没有到达第二个日期时进行循环
		  即！((y1==y2)&&(m1==m2)&&(d1==d2))*/ 
		while(y1<y2 || m1<m2 || d1<d2) {
			d1++;  //天数加 1 
			if(d1 == month[m1][judge(y2)]+1) {  //满当月天数 
				m1++;  //日期变为下个月的 1 号 
				d1 = 1;
			} 
			if(m1 == 13) { //月份满12月 
				y1++;  //日期变为下一年的 1 月 
				m1 = 1;
			}
			ans++; //累计 
		}
		printf("%d\n", ans);  //输出结果 
	    printf("\n");
	}
	return 0;
} 

